test/withoutKubearmor1_10000.txt
====== GET ======
  10000 requests completed in 0.01 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.951 milliseconds (cumulative count 1000)
50.000% <= 5.663 milliseconds (cumulative count 5000)
75.000% <= 7.479 milliseconds (cumulative count 8000)
87.500% <= 8.047 milliseconds (cumulative count 9000)
93.750% <= 8.775 milliseconds (cumulative count 10000)
100.000% <= 8.775 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
10.000% <= 3.103 milliseconds (cumulative count 1000)
40.000% <= 5.103 milliseconds (cumulative count 4000)
50.000% <= 6.103 milliseconds (cumulative count 5000)
70.000% <= 7.103 milliseconds (cumulative count 7000)
90.000% <= 8.103 milliseconds (cumulative count 9000)
100.000% <= 9.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 1000000.00 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        5.974     2.944     5.663     8.775     8.775     8.775